requests/request-get-policy-status.xml

<?xml version="1.0" encoding="utf-8"?>
<!-- WSDL: http://localhost:9080/insurance-health-component/HealthPolicySoapService?wsdl -->
<!-- POST to: http://localhost:9080/insurance-health-component/HealthPolicySoapService -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ns="http://soap.insurance.example.com/">
  <soapenv:Header/>
  <soapenv:Body>
    <ns:getPolicyStatus>
      <policyNumber>POL123</policyNumber>
    </ns:getPolicyStatus>
  </soapenv:Body>
</soapenv:Envelope>